{
    "title":"Jeu de gestion de village",
    "icone":"https://raw.githubusercontent.com/Rafyb/MedievalBuilderGame/master/logo%20medieval%20builder.png",
    "badges":[{
        "link" : "",
        "text" : "Java",
        "class" : "label java"
      }
    ],
    "video":"https://www.youtube.com/embed/Uh6zKaKqCoI",
    "images":[],
    "link":"https://github.com/Rafyb/MedievalBuilderGame",
    "description":"<h2>Membres de l'équipe</h2><ul><li>Développeurs : <ul><li>Raphaël</li><li>Jimmy</li><li>Sully</li><li>Alexis</li></ul></li></ul><h2> Description </h2><p>Medieval Builder est un projet libre réalisé en début de 3éme semestre de DUT. L'objectif était de se remettre au code suite à l'interruption pédagogique de Juillet-Aout en réalisant un projet sur 2 journées en équipe et à l'aide de la Méthode Agile.</p><p>Avec l'équipe, il a donc était décidé de réaliser un jeu de gestion de ville, le temps imposé étant court ( l'objectif n'étant pas de produire un produit complet ) nous avons décider de partir sur l'époque médiévale pour ne pas à avoir à implémenter des problématiques modernes tel qu'une économie complexe, l'éléctriciter, etc ...</p><p> Liste des fonctionnalités implémentés dans le projet : </p><ul><li>La carte :<ul><li>La carte est composée d'un nombre définit de case ( par défaut 35 x 19 )</li><li>Il y a 3 types d'environnement présent sur les cases</li><li> les ' . ' représentent des cases vide semblables à des plaines</li><li> les ' ~ ' représentent des montagnes. Générés aléatoirement, ces cases ne sont pas constructibles sauf pour les mines ( lesquels raportant 2 fois plus d'or si elles sont construites sur ces cases )</li><li> les ' ^ ' représentent des parties de lac ou rivière. Générés aléatoirement, ces cases ne sont pas constructibles</li></ul></li><li>La nourriture, la joie, l'argent :<ul><li>Le principe du je de gestion est d'avoir plusieurs paramètres à controler</li><li>La nourriture, elle est générée par les champs, plus il y a de population plus il y en a de consommée. S'il manque trop de nourriture la population meurt</li><li>La joie, c'est un % représentent la moyenne de bonheur du village. Au dessus de 60% de nouveaux arrivants s'installent dans le village ou la population se reproduit. Si le bonheur tombe à 0, la population se révolte et finit par tuer le roi ( vous )</li><li>L'argent peut être utiliser pour batir des choses, faire face à des événements ou investir. Ne pas en avoir ne signifie pas la fin de la partie cependant cela peut vous bloquer dans certaines situations.</li></ul></li><li>Investissements et événements :<ul><li>Chaque fin d'année il vous ai demandé d'investir dans un domaine. Cette investissement à un coût mais permet de prévenir de certains événements ( améliorer la médecine permet d'empécher des événements d'épidémies ). Cependant vous pouvez décider de ne pas investir et de concerver l'argent.</li><li>Il existe une multitude d'événements qui peuvent survenir de manière aléatoire, ces événements peuvent avoir un impact sur votre population, vos réserve de nourriture, vos productions, ect ...</li></ul></li><li>Les constructions :<ul><li>Les champs : '≋' produisent de la nourriture et peuvent être améliorer pour une meilleure production. Attention cependant, ils ne produisent pas de nourriture durant l'Hiver   </li><li>Les mines : 'Π' produisent de l'argent et peuvent être améliorer pour une meilleure production. Placé sur une montagne la mine apporte 2 fois plus d'or</li><li>Les maisons : '⌂' permettent d'augmenter le nombre d'hébergement et peuvent être améliorer pour plus d'espace. Attention si il n'y a pas assez de place d'hébergement, le bonheur moyen de la population diminue.</li><li>Les routes : '■' sont juste des éléments à titre décoratif, aucune fonction ne leur a été attribué sur le temps imparti</li><li>La taverne : '☕' permet d'améliorer le bonheur des habitants</li><li>La forge : '×' est l'un des dernier ajout réalisé avant la fin du développement. Une fois la forge installée il est possible d'améliorer des batiments existants</li></ul></li></ul>"
}
