{
    "title":"Jeu de gestion de village",
    "icone":"https://raw.githubusercontent.com/Rafyb/Rafyb.github.io/master/src/assets/logo_medieval_builder.png",
    "badges":[{
        "link" : "",
        "text" : "Java",
        "class" : "label java"
      }
    ],
    "video":"https://www.youtube.com/embed/Uh6zKaKqCoI",
    "images":[],
    "link":"https://github.com/Rafyb/MedievalBuilderGame",
    "description":"<h2>Membres de l'équipe</h2><ul><li>Développeurs : <ul><li>Raphaël</li><li>Jimmy</li><li>Sully</li><li>Alexis</li></ul></li></ul><h2> Description </h2><p>Medieval Builder est un projet libre réalisé en début de 3éme semestre de DUT. L'objectif était de se remettre au code suite à l'interruption pédagogique de Juillet-Août en réalisant un projet sur 2 journées en équipe et à l'aide de la Méthode Agile.</p><p>L'équipe a donc décidé de réaliser un jeu de gestion de ville, le temps imposé étant court ( l'objectif n'étant pas de développer un produit complet ) nous avons choisi  de partir sur l'époque médiévale pour ne pas à avoir à implémenter des problématiques modernes telles qu'une économie complexe, l'électricité, etc ...</p><p>Liste des fonctionnalités implémentées dans le projet :</p><ul><li>La carte :<ul><li>La carte est composée d'un nombre défini de cases ( par défaut 35 x 19 )</li><li>Il y a 3 types d'environnement présents sur les cases </li><li>les ' . ' représentent des cases vides semblables à des plaines</li><li>les ' ^ ' représentent des montagnes. Générées aléatoirement, ces cases ne sont pas constructibles sauf pour les mines ( lesquelles rapportent 2 fois plus d'or si elles sont construites sur ces cases )</li><li>les ' ~ ' représentent des parties de lacs ou rivières. Générées aléatoirement, ces cases ne sont pas constructibles</li></ul></li><li>La nourriture, le bonheur, l'argent :<ul><li>Le principe du jeu de gestion est d'avoir plusieurs paramètres à contrôler </li><li>La nourriture, elle, est générée par les champs.Plus  la population est nombreuse, plus il y en a de consommée. S'il manque trop de nourriture, la population meurt.</li><li>La joie, c'est un % représentant la moyenne de bonheur du village. Au dessus de 60% , de nouveaux arrivants s'installent dans le village ou la population se reproduit. Si le bonheur tombe à 0, la population se révolte et finit par tuer le roi ( vous ).</li><li>L'argent peut être utilisé pour bâtir des choses, faire face à des événements ou investir. Ne pas en avoir ne signifie pas la fin de la partie, cependant, cela peut vous bloquer dans certaines situations.</li></ul></li><li>Investissements et événements :<ul><li>Chaque fin d'année il vous est demandé d'investir dans un domaine. Cet investissement a un coût, mais permet de se prémunir de certains événements ( améliorer la médecine permet d'empêcher des événements d'épidémies par exemple ). Cependant, vous pouvez décider de ne pas investir et de conserver l'argent.</li><li>Il existe une multitude d'événements qui peuvent survenir de manière aléatoire, et peuvent avoir un impact sur votre population, vos réserves de nourriture, vos productions, ect ...</li></ul></li><li>Les constructions :<ul><li>Les champs : '≋' produisent de la nourriture et peuvent être améliorés pour une meilleure production. Attention cependant, ils ne produisent pas de nourriture durant l'Hiver.</li><li>Les mines : 'Π' produisent de l'argent et peuvent être améliorées pour une meilleure production. Placée sur une montagne, la mine rapporte 2 fois plus d'or.</li><li>Les maisons : '⌂' permettent d'augmenter le nombre d'hébergements et peuvent être améliorées pour plus d'espace. Attention : si il n'y a pas assez de place d'hébergement, le bonheur moyen de la population diminue.</li><li>Les routes : '■' sont juste des éléments décoratifs, aucune fonction ne leur a été attribuée sur le temps imparti.</li><li>La taverne : '☕' permet d'améliorer le bonheur des habitants.</li><li>La forge : '×' est l'un des dernier ajouts réalisé avant la fin du développement. Une fois la forge installée, il est possible d'améliorer des bâtiments existants.</li></ul></li></ul>"
}
